STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257fxx_cm33.h
    nCTIIRQ1_IRQn               = 201,  /*!< Cortex-M33 CTI interrupt 1                        */
    nCTIIRQ2_IRQn               = 202,  /*!< Cortex-M33 CTI interrupt 2                        */
    TIM13_IRQn                  = 203,  /*!< TIM13 global interrupt                            */
    TIM14_IRQn                  = 204,  /*!< TIM14 global interrupt                            */
    TIM10_IRQn                  = 205,  /*!< TIM10 global interrupt                            */
    RNG_IRQn                    = 206,  /*!< RNG global interrupt                              */
    ADF1_FLT_IRQn               = 207,  /*!< ADF1 Filter interrupt                             */
    I2C6_IRQn                   = 208,  /*!< I2C6 global interrupt                             */
    COMBOPHY_WAKEUP_IRQn        = 209,  /*!< COMBOPHY LFPS start request interrupt             */
    I2C7_IRQn                   = 210,  /*!< I2C7 global interrupt                             */
    RESERVED_211                = 211,  /*!< reserved                                          */
    I2C8_IRQn                   = 212,  /*!< I2C8 global interrupt                             */
    I3C4_IRQn                   = 213,  /*!< I3C4 global interrupt                             */
    SDMMC3_IRQn                 = 214,  /*!< SDMMC3 global interrupt                           */
    LPTIM2_IRQn                 = 215,  /*!< LPTIMER2 global interrupt                         */
    LPTIM3_IRQn                 = 216,  /*!< LPTIMER3 global interrupt                         */
    LPTIM4_IRQn                 = 217,  /*!< LPTIMER4 global interrupt                         */
    LPTIM5_IRQn                 = 218,  /*!< LPTIMER5 global interrupt                         */
    OTFDEC2_IRQn                = 219,  /*!< OTFDEC2 interrupt                                 */
    CPU1_SEV_IRQn               = 220,  /*!< Cortex-A35 Send Event through EXTI                */
    CPU3_SEV_IRQn               = 221,  /*!< Cortex-M0+ Send Event through EXTI                */
    RCC_WAKEUP_IRQn             = 222,  /*!< RCC CPU2 Wake up interrupt                        */
    SAI4_IRQn                   = 223,  /*!< SAI4 global interrupt                             */
    DTS_IRQn                    = 224,  /*!< Temperature sensor interrupt                      */
    TIM11_IRQn                  = 225,  /*!< TIMER11 global interrupt                          */
    CPU2_WAKEUP_PIN_IRQn        = 226,  /*!< Interrupt for all 6 wake-up enabled by CPU2       */
    USB3DR_BC_IRQn              = 227,  /*!< USB3 BC interrupt                                 */
    USB3DR_IRQn                 = 228,  /*!< USB3 interrupt                                    */
    UCPD1_IRQn                  = 229,  /*!< UCPD1 interrupt                                   */
    RESERVED_230                = 230,  /*!< reserved                                          */
    RESERVED_231                = 231,  /*!< reserved                                          */
    RESERVED_232                = 232,  /*!< reserved                                          */
    RESERVED_233                = 233,  /*!< reserved                                          */
    RESERVED_234                = 234,  /*!< reserved                                          */
    RESERVED_235                = 235,  /*!< reserved                                          */
    RESERVED_236                = 236,  /*!< reserved                                          */
    RESERVED_237                = 237,  /*!< reserved                                          */
    RESERVED_238                = 238,  /*!< reserved                                          */
    RESERVED_239                = 239,  /*!< reserved                                          */
    SERF_IRQn                   = 240,  /*!< SERF global interrupt                             */
    BUSPERFM_IRQn               = 241,  /*!< BUS Performance Monitor interrupt                 */
    RAMCFG_IRQn                 = 242,  /*!< RAM configuration global interrupt                */
    DDRCTRL_IRQn                = 243,  /*!< DDRCTRL interrupt                                 */
    DDRPHYC_IRQn                = 244,  /*!< DDRPHY interrupt (active low)                     */
    DFI_ERR_IRQn                = 245,  /*!< DDRPHY DFI error interrupt                        */
    IAC_IRQn                    = 246,  /*!< RIF Illegal access Controller interrupt           */
    VDDCPU_VD_IRQn              = 247,  /*!< VDDCPU voltage detector                           */
    VDDCORE_VD_IRQn             = 248,  /*!< VDDCORE voltage detector                          */
    RESERVED_249                = 249,  /*!< reserved                                          */
    ETHSW_IRQn                  = 250,  /*!< Ethernet Switch global interrupt                  */
    ETHSW_MSGBUF_IRQn           = 251,  /*!< Ethernet ACM Message buffer interrupt             */
    ETHSW_FSC_IRQn              = 252,  /*!< Ethernet ACM Scheduler interrupt                  */
    HPDMA1_WKUP_IRQn            = 253,  /*!< HPDMA1 channel 0 to 15 wake up                    */
    HPDMA2_WKUP_IRQn            = 254,  /*!< HPDMA2 channel 0 to 15 wake up                    */
    HPDMA3_WKUP_IRQn            = 255,  /*!< HPDMA3 channel 0 to 15 wake up                    */
    LPDMA_WKUP_IRQn             = 256,  /*!< LPDMA channel 0 to 3 wake up                      */
    UCPD1_VBUS_IRQn             = 257,  /*!< USB TypeC VBUS valid interrupt                    */
    UCPD1_VSAFE5V_IRQn          = 258,  /*!< USB TypeC VSAFE5V valid interrupt                 */
    RCC_HSI_FMON_IRQn           = 259,  /*!< HSI Frequency Monitor interrupt                   */
    VDDGPU_VD_IRQn              = 260,  /*!< VDDGPU voltage detector interrupt                 */
    RESERVED_261                = 261,  /*!< reserved                                          */
    RESERVED_262                = 262,  /*!< reserved                                          */
    RESERVED_263                = 263,  /*!< reserved                                          */
    RESERVED_264                = 264,  /*!< reserved                                          */
    RESERVED_265                = 265,  /*!< reserved                                          */
    RESERVED_266                = 266,  /*!< reserved                                          */
    RESERVED_267                = 267,  /*!< reserved                                          */
    EXTI1_0_IRQn                = 268,  /*!< EXTI1 Line 0 interrupt                            */
    EXTI1_1_IRQn                = 269,  /*!< EXTI1 Line 1 interrupt                            */
    EXTI1_2_IRQn                = 270,  /*!< EXTI1 Line 2 interrupt                            */
    EXTI1_3_IRQn                = 271,  /*!< EXTI1 Line 3 interrupt                            */
    EXTI1_4_IRQn                = 272,  /*!< EXTI1 Line 4 interrupt                            */
    EXTI1_5_IRQn                = 273,  /*!< EXTI1 Line 5 interrupt                            */
    EXTI1_6_IRQn                = 274,  /*!< EXTI1 Line 6 interrupt                            */
    EXTI1_7_IRQn                = 275,  /*!< EXTI1 Line 7 interrupt                            */
    EXTI1_8_IRQn                = 276,  /*!< EXTI1 Line 8 interrupt                            */
    EXTI1_9_IRQn                = 277,  /*!< EXTI1 Line 9 interrupt                            */
    EXTI1_10_IRQn               = 278,  /*!< EXTI1 Line 10 interrupt                           */
    EXTI1_11_IRQn               = 279,  /*!< EXTI1 Line 11 interrupt                           */
    EXTI1_12_IRQn               = 280,  /*!< EXTI1 Line 12 interrupt                           */
    EXTI1_13_IRQn               = 281,  /*!< EXTI1 Line 13 interrupt                           */
    EXTI1_14_IRQn               = 282,  /*!< EXTI1 Line 14 interrupt                           */
    EXTI1_15_IRQn               = 283,  /*!< EXTI1 Line 15 interrupt                           */
    RESERVED_284                = 284,  /*!< reserved                                          */
    RESERVED_285                = 285,  /*!< reserved                                          */
    RESERVED_286                = 286,  /*!< reserved                                          */
    RESERVED_287                = 287,  /*!< reserved                                          */
    RESERVED_288                = 288,  /*!< reserved                                          */
    RESERVED_289                = 289,  /*!< reserved                                          */
    RESERVED_290                = 290,  /*!< reserved                                          */
    RESERVED_291                = 291,  /*!< reserved                                          */
    RESERVED_292                = 292,  /*!< reserved                                          */
    RESERVED_293                = 293,  /*!< reserved                                          */
    RESERVED_294                = 294,  /*!< reserved                                          */
    RESERVED_295                = 295,  /*!< reserved                                          */
    RESERVED_296                = 296,  /*!< reserved                                          */
    RESERVED_297                = 297,  /*!< reserved                                          */
    RESERVED_298                = 298,  /*!< reserved                                          */
    RESERVED_299                = 299,  /*!< reserved                                          */
    RESERVED_300                = 300,  /*!< reserved                                          */
    RESERVED_301                = 301,  /*!< reserved                                          */
    RESERVED_302                = 302,  /*!< reserved                                          */
    RESERVED_303                = 303,  /*!< reserved                                          */
    RESERVED_304                = 304,  /*!< reserved                                          */
    RESERVED_305                = 305,  /*!< reserved                                          */
    RESERVED_306                = 306,  /*!< reserved                                          */
    RESERVED_307                = 307,  /*!< reserved                                          */
    IS2M_IRQn                   = 308,  /*!< IS2M fault detection interrupt                    */
    RESERVED_309                = 309,  /*!< reserved                                          */
    DDRPERFM_IRQn               = 310,  /*!< DDR Performance Monitor interrupt                 */
    RESERVED_311                = 311,  /*!< reserved                                          */
    RESERVED_312                = 312,  /*!< reserved                                          */
    RESERVED_313                = 313,  /*!< reserved                                          */
    RESERVED_314                = 314,  /*!< reserved                                          */
    RESERVED_315                = 315,  /*!< reserved                                          */
    RESERVED_316                = 316,  /*!< reserved                                          */
    RESERVED_317                = 317,  /*!< reserved                                          */
    RESERVED_318                = 318,  /*!< reserved                                          */
    RESERVED_319                = 319,  /*!< reserved                                          */
    MAX_IRQ_n
  } IRQn_Type;

/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

#define SDC        /*!< Step Down Converter feature */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define CORTEX_IN_SECURE_STATE
#endif

/**
  * @brief Configuration of the Cortex-M33 Processor and Core Peripherals
   */
#define __CM33_REV                0x0100  /*!< Cortex-M33 revision r1p0                       */
#define __MPU_PRESENT             1       /*!< CM33 provides an MPU                           */
#define __SAUREGION_PRESENT       1       /*!< CM33 provides an SAU                           */
#define __NVIC_PRIO_BITS          4       /*!< CM33 uses 4 Bits for the Priority Levels (see IRQLVL) */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used   */
#define __FPU_PRESENT             1       /*!< FPU present                                    */
#define __DSP_PRESENT             1       /*!< DSP extension present                          */
#define __VTOR_PRESENT            1       /*!< Vector Table Offset Register supported         */

#include "core_cm33.h"                     /*!< Cortex-M33 processor and core peripherals      */

/**
  * @}
  */

#include "system_stm32mp2xx.h"
#include <stdint.h>

