STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257fxx_cm33.h
#define EXTI2                       EXTI2_S
#define EXTI2_BASE                  EXTI2_BASE_S

#define EXTI2_C1                    EXTI2_C1_S
#define EXTI2_C1_BASE               EXTI2_C1_BASE_S

#define EXTI2_C2                    EXTI2_C2_S
#define EXTI2_C2_BASE               EXTI2_C2_BASE_S

#define EXTI2_C3                    EXTI2_C3_S
#define EXTI2_C3_BASE               EXTI2_C3_BASE_S

#define HSEM                        HSEM_S
#define HSEM_BASE                   HSEM_BASE_S
#define HSEM_COMMON                 HSEM_COMMON_S

#define IPCC2                       IPCC2_S
#define IPCC2_BASE                  IPCC2_BASE_S

#define IPCC2_C1                    IPCC2_C1_S
#define IPCC2_C1_BASE               IPCC2_C1_BASE_S

#define IPCC2_C2                    IPCC2_C2_S
#define IPCC2_C2_BASE               IPCC2_C2_BASE_S

#define LPDMA_Channel0              LPDMA_Channel0_S
#define LPDMA_Channel0_BASE         LPDMA_Channel0_BASE_S

#define LPDMA_Channel1              LPDMA_Channel1_S
#define LPDMA_Channel1_BASE         LPDMA_Channel1_BASE_S

#define LPDMA_Channel2              LPDMA_Channel2_S
#define LPDMA_Channel2_BASE         LPDMA_Channel2_BASE_S

#define LPDMA_Channel3              LPDMA_Channel3_S
#define LPDMA_Channel3_BASE         LPDMA_Channel3_BASE_S

/*!< APB4 peripherals defaults to Secure aliases */
#define DSI                         DSI_S
#define DSI_BASE                    DSI_BASE_S

#define LTDC                        LTDC_S
#define LTDC_BASE                   LTDC_BASE_S

#define LTDC_Layer1                 LTDC_Layer1_S
#define LTDC_Layer1_BASE            LTDC_Layer1_BASE_S

#define LTDC_Layer2                 LTDC_Layer2_S
#define LTDC_Layer2_BASE            LTDC_Layer2_BASE_S

#define LTDC_Layer3                 LTDC_Layer3_S
#define LTDC_Layer3_BASE            LTDC_Layer3_BASE_S

#define CSI                         CSI_S
#define CSI_BASE                    CSI_BASE_S

#define DCMIPP                      DCMIPP_S
#define DCMIPP_BASE                 DCMIPP_BASE_S

#define DDRC                        DDRC_S
#define DDRC_BASE                   DDRC_BASE_S

#define DDRDBG                      DDRDBG_S
#define DDRDBG_BASE                 DDRDBG_BASE_S

#define DDRPERFM                    DDRPERFM_S
#define DDRPERFM_BASE               DDRPERFM_BASE_S

#define LVDS                        LVDS_S
#define LVDS_BASE                   LVDS_BASE_S
#define STGENR                      STGENR_S
#define STGENR_BASE                 STGENR_BASE_S

#define STGENC                      STGENC_S
#define STGENC_BASE                 STGENC_BASE_S

#define GICV2M                      GICV2M_S
#define GICV2M_BASE                 GICV2M_BASE_S

#define UCPD1                       UCPD1_S
#define UCPD1_BASE                  UCPD1_BASE_S

#define USB3PCIEPHY                 USB3PCIEPHY_S
#define USB3PCIEPHY_BASE            USB3PCIEPHY_BASE_S
#define VENC                        VENC_S
#define VENC_BASE                   VENC_BASE_S
#define VDEC                        VDEC_S
#define VDEC_BASE                   VDEC_BASE_S
/*!< FMC Banks registers defaults to Secure aliases */
#define FMC_Bank1_R                 FMC_Bank1_R_S
#define FMC_Bank1_R_BASE            FMC_Bank1_R_BASE_S

#define FMC_Bank1E_R                FMC_Bank1E_R_S
#define FMC_Bank1E_R_BASE           FMC_Bank1E_R_BASE_S

#define FMC_Bank3_R                 FMC_Bank3_R_S
#define FMC_Bank3_R_BASE            FMC_Bank3_R_BASE_S

#define FMC_Common_R                FMC_Common_R_S
#define FMC_Common_R_BASE           FMC_Common_R_BASE_S

#define SDMMC1                      SDMMC1_S
#define SDMMC1_BASE                 SDMMC1_BASE_S

#define SDMMC2                      SDMMC2_S
#define SDMMC2_BASE                 SDMMC2_BASE_S

#define SDMMC3                      SDMMC3_S
#define SDMMC3_BASE                 SDMMC3_BASE_S
#define GPU                         GPU_S
#define GPU_BASE                    GPU_BASE_S
#define ETH1                        ETH1_S
#define ETH1_BASE                   ETH1_BASE_S
#define ETH2                        ETH2_S
#define ETH2_BASE                   ETH2_BASE_S

#define USBH_OHCI                   USBH_OHCI_S
#define USBH_OHCI_BASE              USBH_OHCI_BASE_S

#define USBH_EHCI                   USBH_EHCI_S
#define USBH_EHCI_BASE              USBH_EHCI_BASE_S

#define USB3                        USB3_S
#define USB3DRD_BASE                USB3DRD_BASE_S

#define CA35SYSCFG                  CA35SYSCFG_S
#define CA35SYSCFG_BASE             CA35SYSCFG_BASE_S

#define DDRPHYC_BASE                DDRPHYC_BASE_S

#define DBGMCU                      DBGMCU_S
#define DBGMCU_BASE                 DBGMCU_BASE_S

/*!< AHB6 peripherals defaults to Secure aliases */
#define ETHSW_ACM                  ETHSW_ACM_S
#define ETHSW_ACM_BASE             ETHSW_ACM_BASE_S

#define ETHSW_ACMMSG               ETHSW_ACMMSG_S
#define ETHSW_ACMMSG_BASE          ETHSW_ACMMSG_BASE_S

#define ETHSW_DEIP                 ETHSW_DEIP_S
#define ETHSW_DEIP_BASE            ETHSW_DEIP_BASE_S
/*!< Device electronic signature memory map */
#define UID_BASE                   (0x54000014UL)            /*!< Unique Device ID register base address */
#define PACKAGE_BASE               (0x540001E8UL)            /*!< Package Data register base address */
#define RPN_BASE                   (0x54000024UL)            /*!< Device Part Number register base address */
#define DV_BASE                    (0x5A010000UL)            /*!< Device Version register base address */

#else /*  CORTEX_IN_SECURE_STATE */
/*!< Peripherals base addresses defaults to Non secure aliases */
#define PERIPH_BASE                 PERIPH_BASE_NS

/*!< Memory base addresses defaults to Non secure aliases */
#define SRAMS_BASE                  SRAMS_BASE_NS

#define SYSRAM_BASE                 SYSRAM_BASE_NS
#define SRAM1_BASE                  SRAM1_BASE_NS
#define SRAM2_BASE                  SRAM2_BASE_NS
#define RETRAM_BASE                 RETRAM_BASE_NS
#define VDERAM_BASE                 VDERAM_BASE_NS
#define LPSRAM1_BASE                LPSRAM1_BASE_NS
#define LPSRAM2_BASE                LPSRAM2_BASE_NS
#define LPSRAM3_BASE                LPSRAM3_BASE_NS

