STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257fxx_cm33.h
/********************  Bit definition for DSI_CR register  ********************/
#define DSI_CR_EN_Pos               (0U)
#define DSI_CR_EN_Msk               (0x1UL << DSI_CR_EN_Pos)              /*!< 0x00000001 */
#define DSI_CR_EN                   DSI_CR_EN_Msk                        /*!< Enable */

/*******************  Bit definition for DSI_CCR register  ********************/
#define DSI_CCR_TXECKDIV_Pos        (0U)
#define DSI_CCR_TXECKDIV_Msk        (0xFFUL << DSI_CCR_TXECKDIV_Pos)      /*!< 0x000000FF */
#define DSI_CCR_TXECKDIV            DSI_CCR_TXECKDIV_Msk                 /*!< TX escape clock division */
#define DSI_CCR_TOCKDIV_Pos         (8U)
#define DSI_CCR_TOCKDIV_Msk         (0xFFUL << DSI_CCR_TOCKDIV_Pos)       /*!< 0x0000FF00 */
#define DSI_CCR_TOCKDIV             DSI_CCR_TOCKDIV_Msk                  /*!< Timeout clock division */

/******************  Bit definition for DSI_LVCIDR register  ******************/
#define DSI_LVCIDR_VCID_Pos         (0U)
#define DSI_LVCIDR_VCID_Msk         (0x3UL << DSI_LVCIDR_VCID_Pos)        /*!< 0x00000003 */
#define DSI_LVCIDR_VCID             DSI_LVCIDR_VCID_Msk                  /*!< Virtual channel ID */

/******************  Bit definition for DSI_LCOLCR register  ******************/
#define DSI_LCOLCR_COLC_Pos         (0U)
#define DSI_LCOLCR_COLC_Msk         (0xFUL << DSI_LCOLCR_COLC_Pos)        /*!< 0x0000000F */
#define DSI_LCOLCR_COLC             DSI_LCOLCR_COLC_Msk                  /*!< Color coding */
#define DSI_LCOLCR_LPE_Pos          (8U)
#define DSI_LCOLCR_LPE_Msk          (0x1UL << DSI_LCOLCR_LPE_Pos)         /*!< 0x00000100 */
#define DSI_LCOLCR_LPE              DSI_LCOLCR_LPE_Msk                   /*!< Loosely packet enable */

/*******************  Bit definition for DSI_LPCR register  *******************/
#define DSI_LPCR_DEP_Pos            (0U)
#define DSI_LPCR_DEP_Msk            (0x1UL << DSI_LPCR_DEP_Pos)           /*!< 0x00000001 */
#define DSI_LPCR_DEP                DSI_LPCR_DEP_Msk                     /*!< Data enable polarity */
#define DSI_LPCR_VSP_Pos            (1U)
#define DSI_LPCR_VSP_Msk            (0x1UL << DSI_LPCR_VSP_Pos)           /*!< 0x00000002 */
#define DSI_LPCR_VSP                DSI_LPCR_VSP_Msk                     /*!< VSYNC polarity */
#define DSI_LPCR_HSP_Pos            (2U)
#define DSI_LPCR_HSP_Msk            (0x1UL << DSI_LPCR_HSP_Pos)           /*!< 0x00000004 */
#define DSI_LPCR_HSP                DSI_LPCR_HSP_Msk                     /*!< HSYNC polarity */

/******************  Bit definition for DSI_LPMCR register  *******************/
#define DSI_LPMCR_VLPSIZE_Pos       (0U)
#define DSI_LPMCR_VLPSIZE_Msk       (0xFFUL << DSI_LPMCR_VLPSIZE_Pos)     /*!< 0x000000FF */
#define DSI_LPMCR_VLPSIZE           DSI_LPMCR_VLPSIZE_Msk                /*!< VACT largest packet size */
#define DSI_LPMCR_LPSIZE_Pos        (16U)
#define DSI_LPMCR_LPSIZE_Msk        (0xFFUL << DSI_LPMCR_LPSIZE_Pos)      /*!< 0x00FF0000 */
#define DSI_LPMCR_LPSIZE            DSI_LPMCR_LPSIZE_Msk                 /*!< Largest packet size */

/*******************  Bit definition for DSI_PCR register  ********************/
#define DSI_PCR_ETTXE_Pos           (0U)
#define DSI_PCR_ETTXE_Msk           (0x1UL << DSI_PCR_ETTXE_Pos)          /*!< 0x00000001 */
#define DSI_PCR_ETTXE               DSI_PCR_ETTXE_Msk                    /*!< EoTp transmission enable */
#define DSI_PCR_ETRXE_Pos           (1U)
#define DSI_PCR_ETRXE_Msk           (0x1UL << DSI_PCR_ETRXE_Pos)          /*!< 0x00000002 */
#define DSI_PCR_ETRXE               DSI_PCR_ETRXE_Msk                    /*!< EoTp reception enable */
#define DSI_PCR_BTAE_Pos            (2U)
#define DSI_PCR_BTAE_Msk            (0x1UL << DSI_PCR_BTAE_Pos)           /*!< 0x00000004 */
#define DSI_PCR_BTAE                DSI_PCR_BTAE_Msk                     /*!< Bus-turn-around enable */
#define DSI_PCR_ECCRXE_Pos          (3U)
#define DSI_PCR_ECCRXE_Msk          (0x1UL << DSI_PCR_ECCRXE_Pos)         /*!< 0x00000008 */
#define DSI_PCR_ECCRXE              DSI_PCR_ECCRXE_Msk                   /*!< ECC reception enable */
#define DSI_PCR_CRCRXE_Pos          (4U)
#define DSI_PCR_CRCRXE_Msk          (0x1UL << DSI_PCR_CRCRXE_Pos)         /*!< 0x00000010 */
#define DSI_PCR_CRCRXE              DSI_PCR_CRCRXE_Msk                   /*!< CRC reception enable */

/******************  Bit definition for DSI_GVCIDR register  ******************/
#define DSI_GVCIDR_VCID_Pos         (0U)
#define DSI_GVCIDR_VCID_Msk         (0x3UL << DSI_GVCIDR_VCID_Pos)        /*!< 0x00000003 */
#define DSI_GVCIDR_VCID             DSI_GVCIDR_VCID_Msk                  /*!< Virtual channel ID */

/*******************  Bit definition for DSI_MCR register  ********************/
#define DSI_MCR_CMDM_Pos            (0U)
#define DSI_MCR_CMDM_Msk            (0x1UL << DSI_MCR_CMDM_Pos)           /*!< 0x00000001 */
#define DSI_MCR_CMDM                DSI_MCR_CMDM_Msk                     /*!< Command mode */

/*******************  Bit definition for DSI_VMCR register  *******************/
#define DSI_VMCR_VMT_Pos            (0U)
#define DSI_VMCR_VMT_Msk            (0x3UL << DSI_VMCR_VMT_Pos)           /*!< 0x00000003 */
#define DSI_VMCR_VMT                DSI_VMCR_VMT_Msk                     /*!< Video mode type */
#define DSI_VMCR_LPVSAE_Pos         (8U)
#define DSI_VMCR_LPVSAE_Msk         (0x1UL << DSI_VMCR_LPVSAE_Pos)        /*!< 0x00000100 */
#define DSI_VMCR_LPVSAE             DSI_VMCR_LPVSAE_Msk                  /*!< Low-power vertical sync active enable */
#define DSI_VMCR_LPVBPE_Pos         (9U)
#define DSI_VMCR_LPVBPE_Msk         (0x1UL << DSI_VMCR_LPVBPE_Pos)        /*!< 0x00000200 */
#define DSI_VMCR_LPVBPE             DSI_VMCR_LPVBPE_Msk                  /*!< Low-power vertical back-porch enable */
#define DSI_VMCR_LPVFPE_Pos         (10U)
#define DSI_VMCR_LPVFPE_Msk         (0x1UL << DSI_VMCR_LPVFPE_Pos)        /*!< 0x00000400 */
#define DSI_VMCR_LPVFPE             DSI_VMCR_LPVFPE_Msk                  /*!< Low-power vertical front-porch enable */
#define DSI_VMCR_LPVAE_Pos          (11U)
#define DSI_VMCR_LPVAE_Msk          (0x1UL << DSI_VMCR_LPVAE_Pos)         /*!< 0x00000800 */
#define DSI_VMCR_LPVAE              DSI_VMCR_LPVAE_Msk                   /*!< Low-power vertical active enable */
#define DSI_VMCR_LPHBPE_Pos         (12U)
#define DSI_VMCR_LPHBPE_Msk         (0x1UL << DSI_VMCR_LPHBPE_Pos)        /*!< 0x00001000 */
#define DSI_VMCR_LPHBPE             DSI_VMCR_LPHBPE_Msk                  /*!< Low-power horizontal back-porch enable */
#define DSI_VMCR_LPHFPE_Pos         (13U)
#define DSI_VMCR_LPHFPE_Msk         (0x1UL << DSI_VMCR_LPHFPE_Pos)        /*!< 0x00002000 */
#define DSI_VMCR_LPHFPE             DSI_VMCR_LPHFPE_Msk                  /*!< Low-power horizontal front-porch enable */
#define DSI_VMCR_FBTAAE_Pos         (14U)
#define DSI_VMCR_FBTAAE_Msk         (0x1UL << DSI_VMCR_FBTAAE_Pos)        /*!< 0x00004000 */
#define DSI_VMCR_FBTAAE             DSI_VMCR_FBTAAE_Msk                  /*!< Frame bus-turn-around acknowledge enable */
#define DSI_VMCR_LPCE_Pos           (15U)
#define DSI_VMCR_LPCE_Msk           (0x1UL << DSI_VMCR_LPCE_Pos)          /*!< 0x00008000 */
#define DSI_VMCR_LPCE               DSI_VMCR_LPCE_Msk                    /*!< Low-power command enable */
#define DSI_VMCR_PGE_Pos            (16U)
#define DSI_VMCR_PGE_Msk            (0x1UL << DSI_VMCR_PGE_Pos)           /*!< 0x00010000 */
#define DSI_VMCR_PGE                DSI_VMCR_PGE_Msk                     /*!< Pattern generator enable */
#define DSI_VMCR_PGM_Pos            (20U)
#define DSI_VMCR_PGM_Msk            (0x1UL << DSI_VMCR_PGM_Pos)           /*!< 0x00100000 */
#define DSI_VMCR_PGM                DSI_VMCR_PGM_Msk                     /*!< Pattern generator mode */
#define DSI_VMCR_PGO_Pos            (24U)
#define DSI_VMCR_PGO_Msk            (0x1UL << DSI_VMCR_PGO_Pos)           /*!< 0x01000000 */
#define DSI_VMCR_PGO                DSI_VMCR_PGO_Msk                     /*!< Pattern generator orientation */

/*******************  Bit definition for DSI_VPCR register  *******************/
#define DSI_VPCR_VPSIZE_Pos         (0U)
#define DSI_VPCR_VPSIZE_Msk         (0x3FFFUL << DSI_VPCR_VPSIZE_Pos)     /*!< 0x00003FFF */
#define DSI_VPCR_VPSIZE             DSI_VPCR_VPSIZE_Msk                  /*!< Video packet size */

