STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257fxx_cm33.h
/******************  Bit definition for DSI_CLTCR register  *******************/
#define DSI_CLTCR_LP2HS_TIME_Pos    (0U)
#define DSI_CLTCR_LP2HS_TIME_Msk    (0x3FFUL << DSI_CLTCR_LP2HS_TIME_Pos) /*!< 0x000003FF */
#define DSI_CLTCR_LP2HS_TIME        DSI_CLTCR_LP2HS_TIME_Msk             /*!< Low-power to high-speed time */
#define DSI_CLTCR_HS2LP_TIME_Pos    (16U)
#define DSI_CLTCR_HS2LP_TIME_Msk    (0x3FFUL << DSI_CLTCR_HS2LP_TIME_Pos) /*!< 0x03FF0000 */
#define DSI_CLTCR_HS2LP_TIME        DSI_CLTCR_HS2LP_TIME_Msk             /*!< High-speed to low-power time */

/******************  Bit definition for DSI_DLTCR register  *******************/
#define DSI_DLTCR_LP2HS_TIME_Pos    (0U)
#define DSI_DLTCR_LP2HS_TIME_Msk    (0x3FFUL << DSI_DLTCR_LP2HS_TIME_Pos) /*!< 0x000003FF */
#define DSI_DLTCR_LP2HS_TIME        DSI_DLTCR_LP2HS_TIME_Msk             /*!< Low-power to high-speed time */
#define DSI_DLTCR_HS2LP_TIME_Pos    (16U)
#define DSI_DLTCR_HS2LP_TIME_Msk    (0x3FFUL << DSI_DLTCR_HS2LP_TIME_Pos) /*!< 0x03FF0000 */
#define DSI_DLTCR_HS2LP_TIME        DSI_DLTCR_HS2LP_TIME_Msk             /*!< High-speed to low-power time */

/******************  Bit definition for DSI_PCTLR register  *******************/
#define DSI_PCTLR_PWEN_Pos          (0U)
#define DSI_PCTLR_PWEN_Msk          (0x1UL << DSI_PCTLR_PWEN_Pos)         /*!< 0x00000001 */
#define DSI_PCTLR_PWEN              DSI_PCTLR_PWEN_Msk                   /*!< Power Enable */
#define DSI_PCTLR_DEN_Pos           (1U)
#define DSI_PCTLR_DEN_Msk           (0x1UL << DSI_PCTLR_DEN_Pos)          /*!< 0x00000002 */
#define DSI_PCTLR_DEN               DSI_PCTLR_DEN_Msk                    /*!< Digital enable */
#define DSI_PCTLR_CKEN_Pos          (2U)
#define DSI_PCTLR_CKEN_Msk          (0x1UL << DSI_PCTLR_CKEN_Pos)         /*!< 0x00000004 */
#define DSI_PCTLR_CKEN              DSI_PCTLR_CKEN_Msk                   /*!< Clock enable */
#define DSI_PCTLR_UCKEN_Pos         (3U)
#define DSI_PCTLR_UCKEN_Msk         (0x1UL << DSI_PCTLR_UCKEN_Pos)        /*!< 0x00000008 */
#define DSI_PCTLR_UCKEN             DSI_PCTLR_UCKEN_Msk                  /*!< ULPS Clock enable */

/******************  Bit definition for DSI_PCONFR register  ******************/
#define DSI_PCONFR_NL_Pos           (0U)
#define DSI_PCONFR_NL_Msk           (0x3UL << DSI_PCONFR_NL_Pos)          /*!< 0x00000003 */
#define DSI_PCONFR_NL               DSI_PCONFR_NL_Msk                    /*!< Number of lanes */
#define DSI_PCONFR_SW_TIME_Pos      (8U)
#define DSI_PCONFR_SW_TIME_Msk      (0xFFUL << DSI_PCONFR_SW_TIME_Pos)    /*!< 0x0000FF00 */
#define DSI_PCONFR_SW_TIME          DSI_PCONFR_SW_TIME_Msk               /*!< Stop wait time */

/*******************  Bit definition for DSI_PUCR register  *******************/
#define DSI_PUCR_URCL_Pos           (0U)
#define DSI_PUCR_URCL_Msk           (0x1UL << DSI_PUCR_URCL_Pos)          /*!< 0x00000001 */
#define DSI_PUCR_URCL               DSI_PUCR_URCL_Msk                    /*!< ULPS request on clock lane */
#define DSI_PUCR_UECL_Pos           (1U)
#define DSI_PUCR_UECL_Msk           (0x1UL << DSI_PUCR_UECL_Pos)          /*!< 0x00000002 */
#define DSI_PUCR_UECL               DSI_PUCR_UECL_Msk                    /*!< ULPS exit on clock lane */
#define DSI_PUCR_URDL_Pos           (2U)
#define DSI_PUCR_URDL_Msk           (0x1UL << DSI_PUCR_URDL_Pos)          /*!< 0x00000004 */
#define DSI_PUCR_URDL               DSI_PUCR_URDL_Msk                    /*!< ULPS request on data lane */
#define DSI_PUCR_UEDL_Pos           (3U)
#define DSI_PUCR_UEDL_Msk           (0x1UL << DSI_PUCR_UEDL_Pos)          /*!< 0x00000008 */
#define DSI_PUCR_UEDL               DSI_PUCR_UEDL_Msk                    /*!< ULPS exit on data lane */

/******************  Bit definition for DSI_PTTCR register  *******************/
#define DSI_PTTCR_TX_TRIG_Pos       (0U)
#define DSI_PTTCR_TX_TRIG_Msk       (0xFUL << DSI_PTTCR_TX_TRIG_Pos)      /*!< 0x0000000F */
#define DSI_PTTCR_TX_TRIG           DSI_PTTCR_TX_TRIG_Msk                /*!< Transmission trigger */

/*******************  Bit definition for DSI_PSR register  ********************/
#define DSI_PSR_PL_Pos              (0U)
#define DSI_PSR_PL_Msk              (0x1UL << DSI_PSR_PL_Pos)             /*!< 0x00000001 */
#define DSI_PSR_PL                  DSI_PSR_PL_Msk                       /*!< PHY lock */
#define DSI_PSR_PD_Pos              (1U)
#define DSI_PSR_PD_Msk              (0x1UL << DSI_PSR_PD_Pos)             /*!< 0x00000002 */
#define DSI_PSR_PD                  DSI_PSR_PD_Msk                       /*!< PHY direction */
#define DSI_PSR_PSSC_Pos            (2U)
#define DSI_PSR_PSSC_Msk            (0x1UL << DSI_PSR_PSSC_Pos)           /*!< 0x00000004 */
#define DSI_PSR_PSSC                DSI_PSR_PSSC_Msk                     /*!< PHY stop state clock lane */
#define DSI_PSR_UANC_Pos            (3U)
#define DSI_PSR_UANC_Msk            (0x1UL << DSI_PSR_UANC_Pos)           /*!< 0x00000008 */
#define DSI_PSR_UANC                DSI_PSR_UANC_Msk                     /*!< ULPS active not clock lane */
#define DSI_PSR_PSS0_Pos            (4U)
#define DSI_PSR_PSS0_Msk            (0x1UL << DSI_PSR_PSS0_Pos)           /*!< 0x00000010 */
#define DSI_PSR_PSS0                DSI_PSR_PSS0_Msk                     /*!< PHY stop state lane 0 */
#define DSI_PSR_UAN0_Pos            (5U)
#define DSI_PSR_UAN0_Msk            (0x1UL << DSI_PSR_UAN0_Pos)           /*!< 0x00000020 */
#define DSI_PSR_UAN0                DSI_PSR_UAN0_Msk                     /*!< ULPS active not lane 0 */
#define DSI_PSR_RUE0_Pos            (6U)
#define DSI_PSR_RUE0_Msk            (0x1UL << DSI_PSR_RUE0_Pos)           /*!< 0x00000040 */
#define DSI_PSR_RUE0                DSI_PSR_RUE0_Msk                     /*!< RX ULPS escape lane 0 */
#define DSI_PSR_PSS1_Pos            (7U)
#define DSI_PSR_PSS1_Msk            (0x1UL << DSI_PSR_PSS1_Pos)           /*!< 0x00000080 */
#define DSI_PSR_PSS1                DSI_PSR_PSS1_Msk                     /*!< PHY stop state lane 1 */
#define DSI_PSR_UAN1_Pos            (8U)
#define DSI_PSR_UAN1_Msk            (0x1UL << DSI_PSR_UAN1_Pos)           /*!< 0x00000100 */
#define DSI_PSR_UAN1                DSI_PSR_UAN1_Msk                     /*!< ULPS active not lane 1 */
#define DSI_PSR_PSS2_Pos            (9U)
#define DSI_PSR_PSS2_Msk            (0x1UL << DSI_PSR_PSS2_Pos)           /*!< 0x00000200 */
#define DSI_PSR_PSS2                DSI_PSR_PSS2_Msk                     /*!< PHY stop state lane 2 */
#define DSI_PSR_UAN2_Pos            (10U)
#define DSI_PSR_UAN2_Msk            (0x1UL << DSI_PSR_UAN2_Pos)           /*!< 0x00000400 */
#define DSI_PSR_UAN2                DSI_PSR_UAN2_Msk                     /*!< ULPS active not lane 2 */
#define DSI_PSR_PSS3_Pos            (11U)
#define DSI_PSR_PSS3_Msk            (0x1UL << DSI_PSR_PSS3_Pos)           /*!< 0x00000800 */
#define DSI_PSR_PSS3                DSI_PSR_PSS3_Msk                     /*!< PHY stop state lane 3 */
#define DSI_PSR_UAN3_Pos            (12U)
#define DSI_PSR_UAN3_Msk            (0x1UL << DSI_PSR_UAN3_Pos)           /*!< 0x00001000 */
#define DSI_PSR_UAN3                DSI_PSR_UAN3_Msk                     /*!< ULPS active not lane 3 */

/******************  Bit definition for DSI_PTCR0 register  *******************/
#define DSI_PTCR0_TRSEN_Pos         (0U)
#define DSI_PTCR0_TRSEN_Msk         (0x1UL << DSI_PTCR0_TRSEN_Pos)        /*!< 0x00000001 */
#define DSI_PTCR0_TRSEN             DSI_PTCR0_TRSEN_Msk                  /*!< Test-interface Reset Enable for the TDI bus into the D-PHY: */
#define DSI_PTCR0_TCKEN_Pos         (1U)
#define DSI_PTCR0_TCKEN_Msk         (0x1UL << DSI_PTCR0_TCKEN_Pos)        /*!< 0x00000002 */
#define DSI_PTCR0_TCKEN             DSI_PTCR0_TCKEN_Msk                  /*!< Test-interface Clock Enable for the TDI bus into the PHY: */

/******************  Bit definition for DSI_PTCR1 register  *******************/
#define DSI_PTCR1_TDI_Pos           (0U)
#define DSI_PTCR1_TDI_Msk           (0xFFUL << DSI_PTCR1_TDI_Pos)         /*!< 0x000000FF */
#define DSI_PTCR1_TDI               DSI_PTCR1_TDI_Msk                    /*!< Test Data In */
#define DSI_PTCR1_TDO_Pos           (8U)
#define DSI_PTCR1_TDO_Msk           (0xFFUL << DSI_PTCR1_TDO_Pos)         /*!< 0x0000FF00 */
#define DSI_PTCR1_TDO               DSI_PTCR1_TDO_Msk                    /*!< Test Data Out */
#define DSI_PTCR1_TWM_Pos           (16U)
#define DSI_PTCR1_TWM_Msk           (0x1UL << DSI_PTCR1_TWM_Pos)          /*!< 0x00010000 */
#define DSI_PTCR1_TWM               DSI_PTCR1_TWM_Msk                    /*!< Test Write Mode, selects the test write access performed to the D-PHY: */

