STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257fxx_cm33.h
/************  Bit definition for ETH_DMAC0RXDLAR register  ************/
#define ETH_DMAC0RXDLAR_RDESLA_Pos          (3U)
#define ETH_DMAC0RXDLAR_RDESLA_Msk          (0x1FFFFFFFUL << ETH_DMAC0RXDLAR_RDESLA_Pos)         /*!< 0xFFFFFFF8 */
#define ETH_DMAC0RXDLAR_RDESLA              ETH_DMAC0RXDLAR_RDESLA_Msk                          /*!< Start of Receive List */
#define ETH_DMAC0RXDLAR_RDESLA_0            (0x1UL << ETH_DMAC0RXDLAR_RDESLA_Pos)                /*!< 0x00000008 */
#define ETH_DMAC0RXDLAR_RDESLA_1            (0x2UL << ETH_DMAC0RXDLAR_RDESLA_Pos)                /*!< 0x00000010 */
#define ETH_DMAC0RXDLAR_RDESLA_2            (0x4UL << ETH_DMAC0RXDLAR_RDESLA_Pos)                /*!< 0x00000020 */
#define ETH_DMAC0RXDLAR_RDESLA_3            (0x8UL << ETH_DMAC0RXDLAR_RDESLA_Pos)                /*!< 0x00000040 */
#define ETH_DMAC0RXDLAR_RDESLA_4            (0x10UL << ETH_DMAC0RXDLAR_RDESLA_Pos)               /*!< 0x00000080 */
#define ETH_DMAC0RXDLAR_RDESLA_5            (0x20UL << ETH_DMAC0RXDLAR_RDESLA_Pos)               /*!< 0x00000100 */
#define ETH_DMAC0RXDLAR_RDESLA_6            (0x40UL << ETH_DMAC0RXDLAR_RDESLA_Pos)               /*!< 0x00000200 */
#define ETH_DMAC0RXDLAR_RDESLA_7            (0x80UL << ETH_DMAC0RXDLAR_RDESLA_Pos)               /*!< 0x00000400 */
#define ETH_DMAC0RXDLAR_RDESLA_8            (0x100UL << ETH_DMAC0RXDLAR_RDESLA_Pos)              /*!< 0x00000800 */
#define ETH_DMAC0RXDLAR_RDESLA_9            (0x200UL << ETH_DMAC0RXDLAR_RDESLA_Pos)              /*!< 0x00001000 */
#define ETH_DMAC0RXDLAR_RDESLA_10           (0x400UL << ETH_DMAC0RXDLAR_RDESLA_Pos)              /*!< 0x00002000 */
#define ETH_DMAC0RXDLAR_RDESLA_11           (0x800UL << ETH_DMAC0RXDLAR_RDESLA_Pos)              /*!< 0x00004000 */
#define ETH_DMAC0RXDLAR_RDESLA_12           (0x1000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)             /*!< 0x00008000 */
#define ETH_DMAC0RXDLAR_RDESLA_13           (0x2000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)             /*!< 0x00010000 */
#define ETH_DMAC0RXDLAR_RDESLA_14           (0x4000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)             /*!< 0x00020000 */
#define ETH_DMAC0RXDLAR_RDESLA_15           (0x8000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)             /*!< 0x00040000 */
#define ETH_DMAC0RXDLAR_RDESLA_16           (0x10000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)            /*!< 0x00080000 */
#define ETH_DMAC0RXDLAR_RDESLA_17           (0x20000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)            /*!< 0x00100000 */
#define ETH_DMAC0RXDLAR_RDESLA_18           (0x40000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)            /*!< 0x00200000 */
#define ETH_DMAC0RXDLAR_RDESLA_19           (0x80000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)            /*!< 0x00400000 */
#define ETH_DMAC0RXDLAR_RDESLA_20           (0x100000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)           /*!< 0x00800000 */
#define ETH_DMAC0RXDLAR_RDESLA_21           (0x200000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)           /*!< 0x01000000 */
#define ETH_DMAC0RXDLAR_RDESLA_22           (0x400000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)           /*!< 0x02000000 */
#define ETH_DMAC0RXDLAR_RDESLA_23           (0x800000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)           /*!< 0x04000000 */
#define ETH_DMAC0RXDLAR_RDESLA_24           (0x1000000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)          /*!< 0x08000000 */
#define ETH_DMAC0RXDLAR_RDESLA_25           (0x2000000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)          /*!< 0x10000000 */
#define ETH_DMAC0RXDLAR_RDESLA_26           (0x4000000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)          /*!< 0x20000000 */
#define ETH_DMAC0RXDLAR_RDESLA_27           (0x8000000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)          /*!< 0x40000000 */
#define ETH_DMAC0RXDLAR_RDESLA_28           (0x10000000UL << ETH_DMAC0RXDLAR_RDESLA_Pos)         /*!< 0x80000000 */

/************  Bit definition for ETH_DMAC0TXDTPR register  ************/
#define ETH_DMAC0TXDTPR_TDT_Pos             (3U)
#define ETH_DMAC0TXDTPR_TDT_Msk             (0x1FFFFFFFUL << ETH_DMAC0TXDTPR_TDT_Pos)            /*!< 0xFFFFFFF8 */
#define ETH_DMAC0TXDTPR_TDT                 ETH_DMAC0TXDTPR_TDT_Msk                             /*!< Transmit Descriptor Tail Pointer */
#define ETH_DMAC0TXDTPR_TDT_0               (0x1UL << ETH_DMAC0TXDTPR_TDT_Pos)                   /*!< 0x00000008 */
#define ETH_DMAC0TXDTPR_TDT_1               (0x2UL << ETH_DMAC0TXDTPR_TDT_Pos)                   /*!< 0x00000010 */
#define ETH_DMAC0TXDTPR_TDT_2               (0x4UL << ETH_DMAC0TXDTPR_TDT_Pos)                   /*!< 0x00000020 */
#define ETH_DMAC0TXDTPR_TDT_3               (0x8UL << ETH_DMAC0TXDTPR_TDT_Pos)                   /*!< 0x00000040 */
#define ETH_DMAC0TXDTPR_TDT_4               (0x10UL << ETH_DMAC0TXDTPR_TDT_Pos)                  /*!< 0x00000080 */
#define ETH_DMAC0TXDTPR_TDT_5               (0x20UL << ETH_DMAC0TXDTPR_TDT_Pos)                  /*!< 0x00000100 */
#define ETH_DMAC0TXDTPR_TDT_6               (0x40UL << ETH_DMAC0TXDTPR_TDT_Pos)                  /*!< 0x00000200 */
#define ETH_DMAC0TXDTPR_TDT_7               (0x80UL << ETH_DMAC0TXDTPR_TDT_Pos)                  /*!< 0x00000400 */
#define ETH_DMAC0TXDTPR_TDT_8               (0x100UL << ETH_DMAC0TXDTPR_TDT_Pos)                 /*!< 0x00000800 */
#define ETH_DMAC0TXDTPR_TDT_9               (0x200UL << ETH_DMAC0TXDTPR_TDT_Pos)                 /*!< 0x00001000 */
#define ETH_DMAC0TXDTPR_TDT_10              (0x400UL << ETH_DMAC0TXDTPR_TDT_Pos)                 /*!< 0x00002000 */
#define ETH_DMAC0TXDTPR_TDT_11              (0x800UL << ETH_DMAC0TXDTPR_TDT_Pos)                 /*!< 0x00004000 */
#define ETH_DMAC0TXDTPR_TDT_12              (0x1000UL << ETH_DMAC0TXDTPR_TDT_Pos)                /*!< 0x00008000 */
#define ETH_DMAC0TXDTPR_TDT_13              (0x2000UL << ETH_DMAC0TXDTPR_TDT_Pos)                /*!< 0x00010000 */
#define ETH_DMAC0TXDTPR_TDT_14              (0x4000UL << ETH_DMAC0TXDTPR_TDT_Pos)                /*!< 0x00020000 */
#define ETH_DMAC0TXDTPR_TDT_15              (0x8000UL << ETH_DMAC0TXDTPR_TDT_Pos)                /*!< 0x00040000 */
#define ETH_DMAC0TXDTPR_TDT_16              (0x10000UL << ETH_DMAC0TXDTPR_TDT_Pos)               /*!< 0x00080000 */
#define ETH_DMAC0TXDTPR_TDT_17              (0x20000UL << ETH_DMAC0TXDTPR_TDT_Pos)               /*!< 0x00100000 */
#define ETH_DMAC0TXDTPR_TDT_18              (0x40000UL << ETH_DMAC0TXDTPR_TDT_Pos)               /*!< 0x00200000 */
#define ETH_DMAC0TXDTPR_TDT_19              (0x80000UL << ETH_DMAC0TXDTPR_TDT_Pos)               /*!< 0x00400000 */
#define ETH_DMAC0TXDTPR_TDT_20              (0x100000UL << ETH_DMAC0TXDTPR_TDT_Pos)              /*!< 0x00800000 */
#define ETH_DMAC0TXDTPR_TDT_21              (0x200000UL << ETH_DMAC0TXDTPR_TDT_Pos)              /*!< 0x01000000 */
#define ETH_DMAC0TXDTPR_TDT_22              (0x400000UL << ETH_DMAC0TXDTPR_TDT_Pos)              /*!< 0x02000000 */
#define ETH_DMAC0TXDTPR_TDT_23              (0x800000UL << ETH_DMAC0TXDTPR_TDT_Pos)              /*!< 0x04000000 */
#define ETH_DMAC0TXDTPR_TDT_24              (0x1000000UL << ETH_DMAC0TXDTPR_TDT_Pos)             /*!< 0x08000000 */
#define ETH_DMAC0TXDTPR_TDT_25              (0x2000000UL << ETH_DMAC0TXDTPR_TDT_Pos)             /*!< 0x10000000 */
#define ETH_DMAC0TXDTPR_TDT_26              (0x4000000UL << ETH_DMAC0TXDTPR_TDT_Pos)             /*!< 0x20000000 */
#define ETH_DMAC0TXDTPR_TDT_27              (0x8000000UL << ETH_DMAC0TXDTPR_TDT_Pos)             /*!< 0x40000000 */
#define ETH_DMAC0TXDTPR_TDT_28              (0x10000000UL << ETH_DMAC0TXDTPR_TDT_Pos)            /*!< 0x80000000 */

/************  Bit definition for ETH_DMAC0RXDTPR register  ************/
#define ETH_DMAC0RXDTPR_RDT_Pos             (3U)
#define ETH_DMAC0RXDTPR_RDT_Msk             (0x1FFFFFFFUL << ETH_DMAC0RXDTPR_RDT_Pos)            /*!< 0xFFFFFFF8 */
#define ETH_DMAC0RXDTPR_RDT                 ETH_DMAC0RXDTPR_RDT_Msk                             /*!< Receive Descriptor Tail Pointer */
#define ETH_DMAC0RXDTPR_RDT_0               (0x1UL << ETH_DMAC0RXDTPR_RDT_Pos)                   /*!< 0x00000008 */
#define ETH_DMAC0RXDTPR_RDT_1               (0x2UL << ETH_DMAC0RXDTPR_RDT_Pos)                   /*!< 0x00000010 */
#define ETH_DMAC0RXDTPR_RDT_2               (0x4UL << ETH_DMAC0RXDTPR_RDT_Pos)                   /*!< 0x00000020 */
#define ETH_DMAC0RXDTPR_RDT_3               (0x8UL << ETH_DMAC0RXDTPR_RDT_Pos)                   /*!< 0x00000040 */
#define ETH_DMAC0RXDTPR_RDT_4               (0x10UL << ETH_DMAC0RXDTPR_RDT_Pos)                  /*!< 0x00000080 */
#define ETH_DMAC0RXDTPR_RDT_5               (0x20UL << ETH_DMAC0RXDTPR_RDT_Pos)                  /*!< 0x00000100 */
#define ETH_DMAC0RXDTPR_RDT_6               (0x40UL << ETH_DMAC0RXDTPR_RDT_Pos)                  /*!< 0x00000200 */
#define ETH_DMAC0RXDTPR_RDT_7               (0x80UL << ETH_DMAC0RXDTPR_RDT_Pos)                  /*!< 0x00000400 */
#define ETH_DMAC0RXDTPR_RDT_8               (0x100UL << ETH_DMAC0RXDTPR_RDT_Pos)                 /*!< 0x00000800 */
#define ETH_DMAC0RXDTPR_RDT_9               (0x200UL << ETH_DMAC0RXDTPR_RDT_Pos)                 /*!< 0x00001000 */
#define ETH_DMAC0RXDTPR_RDT_10              (0x400UL << ETH_DMAC0RXDTPR_RDT_Pos)                 /*!< 0x00002000 */
#define ETH_DMAC0RXDTPR_RDT_11              (0x800UL << ETH_DMAC0RXDTPR_RDT_Pos)                 /*!< 0x00004000 */
#define ETH_DMAC0RXDTPR_RDT_12              (0x1000UL << ETH_DMAC0RXDTPR_RDT_Pos)                /*!< 0x00008000 */
#define ETH_DMAC0RXDTPR_RDT_13              (0x2000UL << ETH_DMAC0RXDTPR_RDT_Pos)                /*!< 0x00010000 */
#define ETH_DMAC0RXDTPR_RDT_14              (0x4000UL << ETH_DMAC0RXDTPR_RDT_Pos)                /*!< 0x00020000 */
#define ETH_DMAC0RXDTPR_RDT_15              (0x8000UL << ETH_DMAC0RXDTPR_RDT_Pos)                /*!< 0x00040000 */
#define ETH_DMAC0RXDTPR_RDT_16              (0x10000UL << ETH_DMAC0RXDTPR_RDT_Pos)               /*!< 0x00080000 */
#define ETH_DMAC0RXDTPR_RDT_17              (0x20000UL << ETH_DMAC0RXDTPR_RDT_Pos)               /*!< 0x00100000 */
#define ETH_DMAC0RXDTPR_RDT_18              (0x40000UL << ETH_DMAC0RXDTPR_RDT_Pos)               /*!< 0x00200000 */
#define ETH_DMAC0RXDTPR_RDT_19              (0x80000UL << ETH_DMAC0RXDTPR_RDT_Pos)               /*!< 0x00400000 */
#define ETH_DMAC0RXDTPR_RDT_20              (0x100000UL << ETH_DMAC0RXDTPR_RDT_Pos)              /*!< 0x00800000 */
#define ETH_DMAC0RXDTPR_RDT_21              (0x200000UL << ETH_DMAC0RXDTPR_RDT_Pos)              /*!< 0x01000000 */
#define ETH_DMAC0RXDTPR_RDT_22              (0x400000UL << ETH_DMAC0RXDTPR_RDT_Pos)              /*!< 0x02000000 */
#define ETH_DMAC0RXDTPR_RDT_23              (0x800000UL << ETH_DMAC0RXDTPR_RDT_Pos)              /*!< 0x04000000 */
#define ETH_DMAC0RXDTPR_RDT_24              (0x1000000UL << ETH_DMAC0RXDTPR_RDT_Pos)             /*!< 0x08000000 */
#define ETH_DMAC0RXDTPR_RDT_25              (0x2000000UL << ETH_DMAC0RXDTPR_RDT_Pos)             /*!< 0x10000000 */
#define ETH_DMAC0RXDTPR_RDT_26              (0x4000000UL << ETH_DMAC0RXDTPR_RDT_Pos)             /*!< 0x20000000 */
#define ETH_DMAC0RXDTPR_RDT_27              (0x8000000UL << ETH_DMAC0RXDTPR_RDT_Pos)             /*!< 0x40000000 */
#define ETH_DMAC0RXDTPR_RDT_28              (0x10000000UL << ETH_DMAC0RXDTPR_RDT_Pos)            /*!< 0x80000000 */

/************  Bit definition for ETH_DMAC0TXRLR register  *************/
#define ETH_DMAC0TXRLR_TDRL_Pos             (0U)
#define ETH_DMAC0TXRLR_TDRL_Msk             (0x3FFUL << ETH_DMAC0TXRLR_TDRL_Pos)                 /*!< 0x000003FF */
#define ETH_DMAC0TXRLR_TDRL                 ETH_DMAC0TXRLR_TDRL_Msk                             /*!< Transmit Descriptor Ring Length */
#define ETH_DMAC0TXRLR_TDRL_0               (0x1UL << ETH_DMAC0TXRLR_TDRL_Pos)                   /*!< 0x00000001 */
#define ETH_DMAC0TXRLR_TDRL_1               (0x2UL << ETH_DMAC0TXRLR_TDRL_Pos)                   /*!< 0x00000002 */
#define ETH_DMAC0TXRLR_TDRL_2               (0x4UL << ETH_DMAC0TXRLR_TDRL_Pos)                   /*!< 0x00000004 */
#define ETH_DMAC0TXRLR_TDRL_3               (0x8UL << ETH_DMAC0TXRLR_TDRL_Pos)                   /*!< 0x00000008 */
#define ETH_DMAC0TXRLR_TDRL_4               (0x10UL << ETH_DMAC0TXRLR_TDRL_Pos)                  /*!< 0x00000010 */
#define ETH_DMAC0TXRLR_TDRL_5               (0x20UL << ETH_DMAC0TXRLR_TDRL_Pos)                  /*!< 0x00000020 */
#define ETH_DMAC0TXRLR_TDRL_6               (0x40UL << ETH_DMAC0TXRLR_TDRL_Pos)                  /*!< 0x00000040 */
#define ETH_DMAC0TXRLR_TDRL_7               (0x80UL << ETH_DMAC0TXRLR_TDRL_Pos)                  /*!< 0x00000080 */
#define ETH_DMAC0TXRLR_TDRL_8               (0x100UL << ETH_DMAC0TXRLR_TDRL_Pos)                 /*!< 0x00000100 */
#define ETH_DMAC0TXRLR_TDRL_9               (0x200UL << ETH_DMAC0TXRLR_TDRL_Pos)                 /*!< 0x00000200 */

/************  Bit definition for ETH_DMAC0RXRLR register  *************/
#define ETH_DMAC0RXRLR_RDRL_Pos             (0U)
#define ETH_DMAC0RXRLR_RDRL_Msk             (0x3FFUL << ETH_DMAC0RXRLR_RDRL_Pos)                 /*!< 0x000003FF */
#define ETH_DMAC0RXRLR_RDRL                 ETH_DMAC0RXRLR_RDRL_Msk                             /*!< Receive Descriptor Ring Length */
#define ETH_DMAC0RXRLR_RDRL_0               (0x1UL << ETH_DMAC0RXRLR_RDRL_Pos)                   /*!< 0x00000001 */
#define ETH_DMAC0RXRLR_RDRL_1               (0x2UL << ETH_DMAC0RXRLR_RDRL_Pos)                   /*!< 0x00000002 */
#define ETH_DMAC0RXRLR_RDRL_2               (0x4UL << ETH_DMAC0RXRLR_RDRL_Pos)                   /*!< 0x00000004 */
#define ETH_DMAC0RXRLR_RDRL_3               (0x8UL << ETH_DMAC0RXRLR_RDRL_Pos)                   /*!< 0x00000008 */
#define ETH_DMAC0RXRLR_RDRL_4               (0x10UL << ETH_DMAC0RXRLR_RDRL_Pos)                  /*!< 0x00000010 */
#define ETH_DMAC0RXRLR_RDRL_5               (0x20UL << ETH_DMAC0RXRLR_RDRL_Pos)                  /*!< 0x00000020 */
#define ETH_DMAC0RXRLR_RDRL_6               (0x40UL << ETH_DMAC0RXRLR_RDRL_Pos)                  /*!< 0x00000040 */
#define ETH_DMAC0RXRLR_RDRL_7               (0x80UL << ETH_DMAC0RXRLR_RDRL_Pos)                  /*!< 0x00000080 */
#define ETH_DMAC0RXRLR_RDRL_8               (0x100UL << ETH_DMAC0RXRLR_RDRL_Pos)                 /*!< 0x00000100 */
#define ETH_DMAC0RXRLR_RDRL_9               (0x200UL << ETH_DMAC0RXRLR_RDRL_Pos)                 /*!< 0x00000200 */
#define ETH_DMAC0RXRLR_ARBS_Pos             (17U)
#define ETH_DMAC0RXRLR_ARBS_Msk             (0x7FUL << ETH_DMAC0RXRLR_ARBS_Pos)                   /*!< 0x00FE0000 */
#define ETH_DMAC0RXRLR_ARBS                 ETH_DMAC0RXRLR_ARBS_Msk                             /*!< Alternate Receive Buffer Size */

/*************  Bit definition for ETH_DMAC0IER register  **************/
#define ETH_DMAC0IER_TIE_Pos                (0U)
#define ETH_DMAC0IER_TIE_Msk                (0x1UL << ETH_DMAC0IER_TIE_Pos)                      /*!< 0x00000001 */
#define ETH_DMAC0IER_TIE                    ETH_DMAC0IER_TIE_Msk                                /*!< Transmit Interrupt Enable */
#define ETH_DMAC0IER_TXSE_Pos               (1U)
#define ETH_DMAC0IER_TXSE_Msk               (0x1UL << ETH_DMAC0IER_TXSE_Pos)                     /*!< 0x00000002 */
#define ETH_DMAC0IER_TXSE                   ETH_DMAC0IER_TXSE_Msk                               /*!< Transmit Stopped Enable */
#define ETH_DMAC0IER_TBUE_Pos               (2U)
#define ETH_DMAC0IER_TBUE_Msk               (0x1UL << ETH_DMAC0IER_TBUE_Pos)                     /*!< 0x00000004 */
#define ETH_DMAC0IER_TBUE                   ETH_DMAC0IER_TBUE_Msk                               /*!< Transmit Buffer Unavailable Enable */
#define ETH_DMAC0IER_RIE_Pos                (6U)
#define ETH_DMAC0IER_RIE_Msk                (0x1UL << ETH_DMAC0IER_RIE_Pos)                      /*!< 0x00000040 */
#define ETH_DMAC0IER_RIE                    ETH_DMAC0IER_RIE_Msk                                /*!< Receive Interrupt Enable */
#define ETH_DMAC0IER_RBUE_Pos               (7U)
#define ETH_DMAC0IER_RBUE_Msk               (0x1UL << ETH_DMAC0IER_RBUE_Pos)                     /*!< 0x00000080 */
#define ETH_DMAC0IER_RBUE                   ETH_DMAC0IER_RBUE_Msk                               /*!< Receive Buffer Unavailable Enable */
#define ETH_DMAC0IER_RSE_Pos                (8U)
#define ETH_DMAC0IER_RSE_Msk                (0x1UL << ETH_DMAC0IER_RSE_Pos)                      /*!< 0x00000100 */
#define ETH_DMAC0IER_RSE                    ETH_DMAC0IER_RSE_Msk                                /*!< Receive Stopped Enable */
#define ETH_DMAC0IER_RWTE_Pos               (9U)
#define ETH_DMAC0IER_RWTE_Msk               (0x1UL << ETH_DMAC0IER_RWTE_Pos)                     /*!< 0x00000200 */
#define ETH_DMAC0IER_RWTE                   ETH_DMAC0IER_RWTE_Msk                               /*!< Receive Watchdog Timeout Enable */
#define ETH_DMAC0IER_ETIE_Pos               (10U)
#define ETH_DMAC0IER_ETIE_Msk               (0x1UL << ETH_DMAC0IER_ETIE_Pos)                     /*!< 0x00000400 */
#define ETH_DMAC0IER_ETIE                   ETH_DMAC0IER_ETIE_Msk                               /*!< Early Transmit Interrupt Enable */
#define ETH_DMAC0IER_ERIE_Pos               (11U)
#define ETH_DMAC0IER_ERIE_Msk               (0x1UL << ETH_DMAC0IER_ERIE_Pos)                     /*!< 0x00000800 */
#define ETH_DMAC0IER_ERIE                   ETH_DMAC0IER_ERIE_Msk                               /*!< Early Receive Interrupt Enable */
#define ETH_DMAC0IER_FBEE_Pos               (12U)
#define ETH_DMAC0IER_FBEE_Msk               (0x1UL << ETH_DMAC0IER_FBEE_Pos)                     /*!< 0x00001000 */
#define ETH_DMAC0IER_FBEE                   ETH_DMAC0IER_FBEE_Msk                               /*!< Fatal Bus Error Enable */
#define ETH_DMAC0IER_CDEE_Pos               (13U)
#define ETH_DMAC0IER_CDEE_Msk               (0x1UL << ETH_DMAC0IER_CDEE_Pos)                     /*!< 0x00002000 */
#define ETH_DMAC0IER_CDEE                   ETH_DMAC0IER_CDEE_Msk                               /*!< Context Descriptor Error Enable */
#define ETH_DMAC0IER_AIE_Pos                (14U)
#define ETH_DMAC0IER_AIE_Msk                (0x1UL << ETH_DMAC0IER_AIE_Pos)                      /*!< 0x00004000 */
#define ETH_DMAC0IER_AIE                    ETH_DMAC0IER_AIE_Msk                                /*!< Abnormal Interrupt Summary Enable */
#define ETH_DMAC0IER_NIE_Pos                (15U)
#define ETH_DMAC0IER_NIE_Msk                (0x1UL << ETH_DMAC0IER_NIE_Pos)                      /*!< 0x00008000 */
#define ETH_DMAC0IER_NIE                    ETH_DMAC0IER_NIE_Msk                                /*!< Normal Interrupt Summary Enable */

/************  Bit definition for ETH_DMAC0RXIWTR register  ************/
#define ETH_DMAC0RXIWTR_RWT_Pos             (0U)
#define ETH_DMAC0RXIWTR_RWT_Msk             (0xFFUL << ETH_DMAC0RXIWTR_RWT_Pos)                  /*!< 0x000000FF */
#define ETH_DMAC0RXIWTR_RWT                 ETH_DMAC0RXIWTR_RWT_Msk                             /*!< Receive Interrupt Watchdog Timer Count */
#define ETH_DMAC0RXIWTR_RWT_0               (0x1UL << ETH_DMAC0RXIWTR_RWT_Pos)                   /*!< 0x00000001 */
#define ETH_DMAC0RXIWTR_RWT_1               (0x2UL << ETH_DMAC0RXIWTR_RWT_Pos)                   /*!< 0x00000002 */
#define ETH_DMAC0RXIWTR_RWT_2               (0x4UL << ETH_DMAC0RXIWTR_RWT_Pos)                   /*!< 0x00000004 */
#define ETH_DMAC0RXIWTR_RWT_3               (0x8UL << ETH_DMAC0RXIWTR_RWT_Pos)                   /*!< 0x00000008 */
#define ETH_DMAC0RXIWTR_RWT_4               (0x10UL << ETH_DMAC0RXIWTR_RWT_Pos)                  /*!< 0x00000010 */
#define ETH_DMAC0RXIWTR_RWT_5               (0x20UL << ETH_DMAC0RXIWTR_RWT_Pos)                  /*!< 0x00000020 */
#define ETH_DMAC0RXIWTR_RWT_6               (0x40UL << ETH_DMAC0RXIWTR_RWT_Pos)                  /*!< 0x00000040 */
#define ETH_DMAC0RXIWTR_RWT_7               (0x80UL << ETH_DMAC0RXIWTR_RWT_Pos)                  /*!< 0x00000080 */
#define ETH_DMAC0RXIWTR_RWTU_Pos            (16U)
#define ETH_DMAC0RXIWTR_RWTU_Msk            (0x3UL << ETH_DMAC0RXIWTR_RWTU_Pos)                   /*!< 0x00030000 */
#define ETH_DMAC0RXIWTR_RWTU                ETH_DMAC0RXIWTR_RWTU_Msk                            /*!< Receive Interrupt Watchdog Timer Count Units */

/************  Bit definition for ETH_DMAC0SFCSR register  *************/
#define ETH_DMAC0SFCSR_ESC_Pos              (0U)
#define ETH_DMAC0SFCSR_ESC_Msk              (0x1UL << ETH_DMAC0SFCSR_ESC_Pos)                    /*!< 0x00000001 */
#define ETH_DMAC0SFCSR_ESC                  ETH_DMAC0SFCSR_ESC_Msk                              /*!< Enable Slot Comparison */
#define ETH_DMAC0SFCSR_ASC_Pos              (1U)
#define ETH_DMAC0SFCSR_ASC_Msk              (0x1UL << ETH_DMAC0SFCSR_ASC_Pos)                    /*!< 0x00000002 */
#define ETH_DMAC0SFCSR_ASC                  ETH_DMAC0SFCSR_ASC_Msk                              /*!< Advance Slot Check */
#define ETH_DMAC0SFCSR_SIV_Pos              (4U)
#define ETH_DMAC0SFCSR_SIV_Msk              (0xFFFUL << ETH_DMAC0SFCSR_SIV_Pos)                   /*!< 0x0000FFF0 */
#define ETH_DMAC0SFCSR_SIV                  ETH_DMAC0SFCSR_SIV_Msk                              /*!< Slot Interval Value */
#define ETH_DMAC0SFCSR_RSN_Pos              (16U)
#define ETH_DMAC0SFCSR_RSN_Msk              (0xFUL << ETH_DMAC0SFCSR_RSN_Pos)                    /*!< 0x000F0000 */
#define ETH_DMAC0SFCSR_RSN                  ETH_DMAC0SFCSR_RSN_Msk                              /*!< Reference Slot Number */
#define ETH_DMAC0SFCSR_RSN_0                (0x1UL << ETH_DMAC0SFCSR_RSN_Pos)                    /*!< 0x00010000 */
#define ETH_DMAC0SFCSR_RSN_1                (0x2UL << ETH_DMAC0SFCSR_RSN_Pos)                    /*!< 0x00020000 */
#define ETH_DMAC0SFCSR_RSN_2                (0x4UL << ETH_DMAC0SFCSR_RSN_Pos)                    /*!< 0x00040000 */
#define ETH_DMAC0SFCSR_RSN_3                (0x8UL << ETH_DMAC0SFCSR_RSN_Pos)                    /*!< 0x00080000 */

