STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257fxx_cm33.h
#define IS_LPDMA_INSTANCE(INSTANCE) (((INSTANCE) == LPDMA_Channel0_S) || ((INSTANCE) == LPDMA_Channel0_NS) || \
                                     ((INSTANCE) == LPDMA_Channel1_S) || ((INSTANCE) == LPDMA_Channel1_NS) || \
                                     ((INSTANCE) == LPDMA_Channel2_S) || ((INSTANCE) == LPDMA_Channel2_NS) || \
                                     ((INSTANCE) == LPDMA_Channel3_S) || ((INSTANCE) == LPDMA_Channel3_NS))

#define IS_DMA_2D_ADDRESSING_INSTANCE(INSTANCE) (((INSTANCE) == HPDMA1_Channel12_S) || ((INSTANCE) == HPDMA1_Channel12_NS) || \
                                                 ((INSTANCE) == HPDMA1_Channel13_S) || ((INSTANCE) == HPDMA1_Channel13_NS) || \
                                                 ((INSTANCE) == HPDMA1_Channel14_S) || ((INSTANCE) == HPDMA1_Channel14_NS) || \
                                                 ((INSTANCE) == HPDMA1_Channel15_S) || ((INSTANCE) == HPDMA1_Channel15_NS) || \
                                                 ((INSTANCE) == HPDMA2_Channel12_S) || ((INSTANCE) == HPDMA2_Channel12_NS) || \
                                                 ((INSTANCE) == HPDMA2_Channel13_S) || ((INSTANCE) == HPDMA2_Channel13_NS) || \
                                                 ((INSTANCE) == HPDMA2_Channel14_S) || ((INSTANCE) == HPDMA2_Channel14_NS) || \
                                                 ((INSTANCE) == HPDMA2_Channel15_S) || ((INSTANCE) == HPDMA2_Channel15_NS) || \
                                                 ((INSTANCE) == HPDMA3_Channel12_S) || ((INSTANCE) == HPDMA3_Channel12_NS) || \
                                                 ((INSTANCE) == HPDMA3_Channel13_S) || ((INSTANCE) == HPDMA3_Channel13_NS) || \
                                                 ((INSTANCE) == HPDMA3_Channel14_S) || ((INSTANCE) == HPDMA3_Channel14_NS) || \
                                                 ((INSTANCE) == HPDMA3_Channel15_S) || ((INSTANCE) == HPDMA3_Channel15_NS))
												
#define IS_DMA_PFREQ_INSTANCE(INSTANCE) (((INSTANCE) == HPDMA1_Channel12_S) || ((INSTANCE) == HPDMA1_Channel12_NS) || \
                                         ((INSTANCE) == HPDMA1_Channel13_S) || ((INSTANCE) == HPDMA1_Channel13_NS) || \
                                         ((INSTANCE) == HPDMA1_Channel14_S) || ((INSTANCE) == HPDMA1_Channel14_NS) || \
                                         ((INSTANCE) == HPDMA1_Channel15_S) || ((INSTANCE) == HPDMA1_Channel15_NS) || \
                                         ((INSTANCE) == HPDMA2_Channel12_S) || ((INSTANCE) == HPDMA2_Channel12_NS) || \
                                         ((INSTANCE) == HPDMA2_Channel13_S) || ((INSTANCE) == HPDMA2_Channel13_NS) || \
                                         ((INSTANCE) == HPDMA2_Channel14_S) || ((INSTANCE) == HPDMA2_Channel14_NS) || \
                                         ((INSTANCE) == HPDMA2_Channel15_S) || ((INSTANCE) == HPDMA2_Channel15_NS) || \
                                         ((INSTANCE) == HPDMA3_Channel12_S) || ((INSTANCE) == HPDMA3_Channel12_NS) || \
                                         ((INSTANCE) == HPDMA3_Channel13_S) || ((INSTANCE) == HPDMA3_Channel13_NS) || \
                                         ((INSTANCE) == HPDMA3_Channel14_S) || ((INSTANCE) == HPDMA3_Channel14_NS) || \
                                         ((INSTANCE) == HPDMA3_Channel15_S) || ((INSTANCE) == HPDMA3_Channel15_NS) || \
                                         ((INSTANCE) == LPDMA_Channel0_S)   || ((INSTANCE) == LPDMA_Channel0_NS)   || \
                                         ((INSTANCE) == LPDMA_Channel1_S)   || ((INSTANCE) == LPDMA_Channel1_NS)   || \
                                         ((INSTANCE) == LPDMA_Channel2_S)   || ((INSTANCE) == LPDMA_Channel2_NS)   || \
                                         ((INSTANCE) == LPDMA_Channel3_S)   || ((INSTANCE) == LPDMA_Channel3_NS))

/******************************** EXTI Instances **********************************/
#define IS_EXTI_ALL_INSTANCE(INSTANCE)  ( ((INSTANCE) == EXTI1_S) || ((INSTANCE) == EXTI1_NS) || \
                                          ((INSTANCE) == EXTI2_S) || ((INSTANCE) == EXTI2_NS) )

/******************************* FDCAN Instances *******************************/
#define IS_FDCAN_ALL_INSTANCE(INSTANCE) (((INSTANCE) == FDCAN1_S) || ((INSTANCE) == FDCAN1_NS) || \
                                         ((INSTANCE) == FDCAN2_S) || ((INSTANCE) == FDCAN2_NS) || \
                                         ((INSTANCE) == FDCAN3_S) || ((INSTANCE) == FDCAN3_NS))

#define IS_FDCAN_TT_INSTANCE(INSTANCE) (((INSTANCE) == FDCAN1_S) || ((INSTANCE) == FDCAN1_NS))
/******************************* GPIO Instances *******************************/
#define IS_GPIO_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPIOA_S) || ((INSTANCE) == GPIOA_NS) || \
                                        ((INSTANCE) == GPIOB_S) || ((INSTANCE) == GPIOB_NS) || \
                                        ((INSTANCE) == GPIOC_S) || ((INSTANCE) == GPIOC_NS) || \
                                        ((INSTANCE) == GPIOD_S) || ((INSTANCE) == GPIOD_NS) || \
                                        ((INSTANCE) == GPIOE_S) || ((INSTANCE) == GPIOE_NS) || \
                                        ((INSTANCE) == GPIOF_S) || ((INSTANCE) == GPIOF_NS) || \
                                        ((INSTANCE) == GPIOG_S) || ((INSTANCE) == GPIOG_NS) || \
                                        ((INSTANCE) == GPIOH_S) || ((INSTANCE) == GPIOH_NS) || \
                                        ((INSTANCE) == GPIOI_S) || ((INSTANCE) == GPIOI_NS) || \
                                        ((INSTANCE) == GPIOJ_S) || ((INSTANCE) == GPIOJ_NS) || \
                                        ((INSTANCE) == GPIOK_S) || ((INSTANCE) == GPIOK_NS) || \
                                        ((INSTANCE) == GPIOZ_S) || ((INSTANCE) == GPIOZ_NS))

/**************************** GPIO AF Instances *******************************/
/* On MP2, all GPIO Bank support AF */
#define IS_GPIO_AF_INSTANCE IS_GPIO_ALL_INSTANCE

/**************************** GPIO Lock Instances *****************************/
/* On MP2, all GPIO Bank support the Lock mechanism */
#define IS_GPIO_LOCK_INSTANCE(INSTANCE) IS_GPIO_ALL_INSTANCE(INSTANCE)

